renesas/ra-fsp-examples/example_projects/ek_ra2e2/_quickstart/quickstart_ek_ra2e2_ep/e2studio/src/r_console_if.c
/**********************************************************************************************************************
 * File Name    : r_console_if.c
 * Description  : RTT console support implementation file.
 *********************************************************************************************************************/

/***********************************************************************************************************************
* Copyright (c) 2020 - 2024 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_typedefs.h"
#include "r_console_if.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/

#define SEGGER_ERR_PRINT(fn_, ...)  if(LVL_ERR)\
                    SEGGER_RTT_printf (SEGGER_INDEX, "[ERR] In Function: %s(), %s",__FUNCTION__,(fn_),##__VA_ARGS__);

#define SEGGER_ERR_TRAP(err)        if (err) {\
                    SEGGER_RTT_printf(SEGGER_INDEX, "\r\nReturned Error Code: 0x%x  \r\n", err);\
                    __asm("BKPT #0\n");} /* trap upon the error  */

#define SEGGER_READ(read_data)      SEGGER_RTT_Read (SEGGER_INDEX, read_data, sizeof(read_data))

#define SEGGER_CHECK_DATA           SEGGER_RTT_HasKey()


/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CONSOLE_IsInputReady
 * Description  : Check for input from user console, non-blocking
 * Return Value : Returns TRUE if input is ready
 *********************************************************************************************************************/
bool_t R_CONSOLE_IsInputReady(void)
{
    bool_t ret = TRUE;

    if (0 == SEGGER_CHECK_DATA)
    {
        ret = FALSE;
    }
    return (ret);
}
/**********************************************************************************************************************
 End of function R_CONSOLE_IsInputReady
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: R_CONSOLE_WaitForInput
 * Description  : Blocking in function till key is pressed on console
 * Argument     :
 * Return Value : .
 *********************************************************************************************************************/
void R_CONSOLE_WaitForInput()
{
    while (!R_CONSOLE_IsInputReady())
    {
        __asm volatile ("nop");
    }
}
/**********************************************************************************************************************
 End of function R_CONSOLE_WaitForInput
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CONSOLE_WaitForAnyKey
 * Description  : Blocking in function till key is pressed on console, input is discarded
 * Argument     :
 * Return Value : .
 *********************************************************************************************************************/
void R_CONSOLE_WaitForAnyKey()
{
    R_CONSOLE_WaitForInput();

    R_CONSOLE_EmptyInputBuffer();
}
/**********************************************************************************************************************
 End of function R_CONSOLE_WaitForAnyKey
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CONSOLE_EmptyInputBuffer
 * Description  : Flushes input buffer of surplus contents, resetting the buffer to empty
 * Argument     : None
 * Return Value : None
 *********************************************************************************************************************/
void R_CONSOLE_EmptyInputBuffer(void)
{
    while (R_CONSOLE_IsInputReady())
    {
        char_t temp_char;
        R_CONSOLE_ReadByte(&temp_char);
    }
}
/**********************************************************************************************************************
 End of function R_CONSOLE_EmptyInputBuffer
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: R_CONSOLE_ReadByte
 * Description  : Reads single byte of data from console
 * Param[out]   : read_byte_buffer -  single byte buffer containing data read from console
 * Return Value : error code (only 0 implemented)
 *********************************************************************************************************************/
int_t R_CONSOLE_ReadByte(char_t *read_byte_buffer)
{
    int_t err = 0;

    R_CONSOLE_WaitForInput();

    SEGGER_READ(read_byte_buffer);

    return (err);
}
/**********************************************************************************************************************
 End of function R_CONSOLE_ReadByte
 *********************************************************************************************************************/

